In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv('data/BlackFriday.csv')

In [4]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [5]:
df.shape

(537577, 12)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     537577 non-null  int64
 1   Product_ID                  537577 non-null  object
 2   Gender                      537577 non-null  object
 3   Age                         537577 non-null  object
 4   Occupation                  537577 non-null  int64
 5   City_Category               537577 non-null  object
 6   Stay_In_Current_City_Years  537577 non-null  object
 7   Marital_Status              537577 non-null  int64
 8   Product_Category_1          537577 non-null  int64
 9   Product_Category_2          370591 non-null  float64
 10  Product_Category_3          164278 non-null  float64
 11  Purchase                    537577 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [14]:
df.describe(include='object')

       Product_ID  Gender     Age City_Category Stay_In_Current_City_Years
count      537577  537577  537577        537577                     537577
unique       3623       2       7             3                          5
top     P00265242       M   26-35             B                          1
freq         1858  405380  214690        226493                     189192

In [9]:
round(df['Gender'].value_counts(normalize=True),3)

M    0.754
F    0.246
Name: Gender, dtype: float64

In [13]:
df['Age'].value_counts

<bound method IndexOpsMixin.value_counts of 0          0-17
1          0-17
2          0-17
3          0-17
4           55+
          ...
537572    36-45
537573    36-45
537574    36-45
537575    36-45
537576    36-45
Name: Age, Length: 537577, dtype: object>

In [12]:
round(df['City_Category'].value_counts(normalize=True),3)

B    0.421
C    0.310
A    0.269
Name: City_Category, dtype: float64

В таблице 537577 строк и 12 столбцов.